var Resource = {
	Config: {
		maxPlayer: 10,
		buyin: 100, // $100
		blindLevel: 5, // every 5 minutes
	},
	Message: {
		ALREADY_INITIALIZED: "既に初期化されています",
		INITIALIZED: "テキサスホールデムに参加される方は「join」と書いてください(最大%1名)",
		CONFIRM_PREFIX: "確認: ",
		CONFIRM_POSTFIX: " (y/n)",
		CONFIRM_CANCELED: "キャンセルされました: ",
		CONFIRM_SHUTDOWN: "シャットダウンしてよろしいですか？",
		TABLE_ALREADY_SEALED: "すでに参加申し込みは打ち切られています",
		TABLE_USER_ALREADY_JOINED: "%1さんは既に参加されています",
		TABLE_USER_MAX: "すでにテーブルは一杯です。これ以上参加出来ません",
		JOINED_SUCCESSFULLY: "%1さんが参加しました。残り%2名参加可能です。今すぐ開始する場合は「start」と書いてください",
		NOT_ENOUGH_PLAYER: "参加者が足りません。最低2名必要です",
		CONFIRM_START: "ゲームを開始してよろしいですか？",
		START_GAME: "ゲームを開始します。参加者は%1名、バイインは%2です",
		TOURNAMENT_INFO: "参加者%1名、ブラインド間隔%2分、賞金額は上位%3名に上から %4です",
	},
	BlindStructure: {
		regular: [
			[10, 20, 0],
			[15, 30, 0],
			[25, 50, 0],
			[50, 100, 0],
			[75, 150, 0],
			[100, 200, 25],
			[150, 300, 25],
			[200, 400, 25],
			[300, 600, 50],
			[400, 800, 50],
			[600, 1200, 50],
			[800, 1600, 100],
			[1000, 2000, 100],
			[1500, 3000, 100],
			[2000, 4000, 500],
			[3000, 6000, 500],
			[5000, 10000, 500],
			[7500, 15000, 1000],
			[10000, 20000, 1000],
			[20000, 40000, 1000],
			[30000, 60000, 5000],
			[50000, 100000, 5000],
			[100000, 200000, 5000],
			[200000, 400000, 10000],
			[400000, 800000, 10000],
			[750000, 1500000, 10000],
			[150000, 3000000, 50000],
			[300000, 6000000, 50000],
			[500000, 10000000, 50000],
			[1000000, 20000000, 100000]
		],
	},
};

module.exports = Resource;
